In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = {'Country': ['Belgium', 'India', 'Brazil',],
        'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
        'Population': [11190846, 1303171035, 207847528]}

# Series

In [3]:
s1 = pd.Series(data['Country'])

In [4]:
s1

0    Belgium
1      India
2     Brazil
dtype: object

In [5]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [6]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
s1 = pd.Series(data['Country'], index=['A', 'B', 'C'])

In [8]:
s1

A    Belgium
B      India
C     Brazil
dtype: object

In [9]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [10]:
s1.index

Index(['A', 'B', 'C'], dtype='object')

# Dataframe

In [11]:
df1 = pd.DataFrame(data)

In [12]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [15]:
cou = df1['Country']

In [16]:
cou

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [17]:
type(cou)

pandas.core.series.Series

In [18]:
df1.iterrows()

In [20]:
for row in df1.iterrows():
    print(row), print(type(row)), print(len(row)),

(0, Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object)
<class 'tuple'>
2
(1, Country            India
Capital        New Delhi
Population    1303171035
Name: 1, dtype: object)
<class 'tuple'>
2
(2, Country          Brazil
Capital        Brasilia
Population    207847528
Name: 2, dtype: object)
<class 'tuple'>
2

In [22]:
for row in df1.iterrows():
    print(row[0], type(row[0]), row[1], type(row[1]),)
    break

0 <class 'int'> Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object <class 'pandas.core.series.Series'>

# 通过series创建dataframe

In [23]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [56]:
s2 = pd.Series(data['Capital'])

In [57]:
s1 = pd.Series(data['Country'])

In [58]:
s3 = pd.Series(data['Population'])

In [59]:
df_new = pd.DataFrame([s1,s2,s3])

In [60]:
df_new

          0           1          2
0   Belgium       India     Brazil
1  Brussels   New Delhi   Brasilia
2  11190846  1303171035  207847528

In [61]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [62]:
df_new = df_new.T

In [63]:
df_new

         0          1           2
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [64]:
df_new = pd.DataFrame([s1,s2,s3], index=['Capital','Country','Population'])

In [65]:
df_new = df_new.T

In [66]:
df_new

   Capital    Country  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [67]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [68]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528